"use client";

import React from "react";
import { Typography, Card, Col, Divider } from "antd";

const { Title, Paragraph, Text } = Typography;

const PrivacyPolicy = () => {
  return (
    <Col>
      <Card>
        <Typography>
          {/* Заголовок */}
          <Title level={2}>Политика конфиденциальности</Title>
          <Divider />

          {/* ОБЛАСТЬ ПРИМЕНЕНИЯ и СОГЛАСИЕ */}
          <Paragraph>
            <Text>
              Персональные данные физических лиц‑пользователей сервиса SCK.KZ обрабатываются ТОО «SCK», находящимся по адресу: Республика Казахстан, Северо‑Казахстанская область, г. Петропавловск,
              БЦ Алем, ул. Букетова, дом 31А, офис 5 (далее – Администрация сайта). Администрация сайта является собственником и оператором Базы персональных данных пользователей SCK.KZ.
            </Text>
            <br />
            <Text>
              База персональных данных пользователей SCK.KZ находится по месту нахождения Администрации сайта.
            </Text>
            <br />
            <Text>
              Настоящая Политика конфиденциальности описывает установленный Администрацией сайта порядок обработки персональных данных, собранных с помощью интернет-ресурса WWW.SCK.KZ (далее — Сайт), и связанных с ними услуг и инструментов на Сайте.
              Во всех указанных случаях Администрация сайта обрабатывает персональные данные пользователей исключительно в рамках требований Закона Республики Казахстан от 21 мая 2013 года № 94-V «О персональных данных и их защите»,
              а также международных договоров, ратифицированных РК. Данная Политика конфиденциальности разработана в соответствии с их нормами.
            </Text>
            <br />
            <Text>
              Пользователи должны знать, что при переходе на некоторые ссылки, размещённые на Сайте, они могут быть перенаправлены к сайтам (приложениям и т.д.) других компаний за пределы хостингового пространства Администрации сайта,
              где информация о Пользователях собирается вне прямого контроля ТОО «SCK». В таком случае Политики конфиденциальности сайтов и/или приложений третьих лиц будут регулировать порядок обработки информации, полученной от пользователей этими третьими лицами.
            </Text>
          </Paragraph>

          {/* 1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ */}
          <Paragraph>
            <Title level={4}>1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</Title>
            <Text>
              1.1. В настоящей Политике конфиденциальности используются следующие термины:
            </Text>
            <br />
            <Text>
              1.1.1. ТОО «SCK» (далее – Администрация сайта) – уполномоченные сотрудники на управление сайтом, действующие от имени ТОО «SCK» (SCK), которые организуют и (или) осуществляют обработку персональных данных,
              а также определяют цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.
            </Text>
            <br />
            <Text>
              1.1.2. «Персональные данные» — любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу (субъекту персональных данных), за исключением информации,
              не относящейся в соответствии с законодательством Республики Казахстан к охраняемым персональным данным.
            </Text>
            <br />
            <Text>
              1.1.3. «Обработка персональных данных» — любое действие (операция) или совокупность действий (операций),
              совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение),
              извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.
            </Text>
            <br />
            <Text>
              1.1.4. «Конфиденциальность персональных данных» — обязательное для соблюдения Администрацией сайта или иным получившим доступ к персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.
            </Text>
            <br />
            <Text>
              1.1.5. «Пользователь интернет-магазина „SCK“ (далее – Пользователь) – физическое лицо, имеющее доступ к Сайту, посредством сети Интернет и использующее Сайт интернет-магазина „SCK.KZ“.
            </Text>
            <br />
            <Text>
              1.1.6. «Cookies» — небольшой фрагмент данных, отправленный веб-сервером и хранимый на компьютере пользователя,
              который веб-клиент или веб-браузер каждый раз пересылает веб-серверу в HTTP-запросе при попытке открыть страницу соответствующего сайта.
            </Text>
            <br />
            <Text>
              1.1.7. «IP-адрес» — уникальный сетевой адрес узла в компьютерной сети, построенной по протоколу IP.
            </Text>
          </Paragraph>

          {/* 2. ОБЩИЕ ПОЛОЖЕНИЯ */}
          <Paragraph>
            <Title level={4}>2. ОБЩИЕ ПОЛОЖЕНИЯ</Title>
            <Text>
              2.1. Использование Пользователем интернет-магазина «SCK» означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.
            </Text>
            <br />
            <Text>
              2.2. В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование интернет-магазина «SCK».
            </Text>
            <br />
            <Text>
              2.3. Настоящая Политика конфиденциальности применяется только к сайту Интернет-магазина «SCK», принадлежащего ТОО «SCK». ТОО «SCK» и интернет-магазин «SCK» не контролирует и не несет ответственность за сайты третьих лиц,
              на которые Пользователь может перейти по ссылкам, доступным на сайте Интернет-магазина «SCK».
            </Text>
            <br />
            <Text>
              2.4. Администрация сайта не проверяет достоверность персональных данных, предоставляемых Пользователем сайта Интернет-магазина «SCK».
            </Text>
          </Paragraph>

          {/* 3. ПРЕДМЕТ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ */}
          <Paragraph>
            <Title level={4}>3. ПРЕДМЕТ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ</Title>
            <Text>
              3.1. Настоящая Политика конфиденциальности устанавливает обязательства Администрации сайта интернет-магазина «SCK» по неразглашению и обеспечению режима защиты конфиденциальности персональных данных,
              которые Пользователь предоставляет по запросу Администрации сайта при регистрации на сайте Интернет-магазина «SCK» или при оформлении заказа для приобретения Товара.
            </Text>
            <br />
            <Text>
              3.2. Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности, предоставляются Пользователем путём заполнения регистрационной формы на сайте Интернет-магазина «SCK» и включают в себя следующую информацию:
            </Text>
            <br />
            <Text>
              3.2.1. фамилию, имя, отчество (отчество – по желанию) Пользователя;
            </Text>
            <br />
            <Text>
              3.2.2. контактный телефон Пользователя;
            </Text>
            <br />
            <Text>
              3.2.3. адрес электронной почты (e‑mail);
            </Text>
            <br />
            <Text>
              3.2.4. адрес доставки Товара;
            </Text>
            <br />
            <Text>
              3.2.5. место жительства Пользователя.
            </Text>
            <br />
            <Text>
              3.3. Интернет-магазин «SCK» защищает данные, которые автоматически передаются в процессе просмотра рекламных блоков и при посещении страниц, на которых установлен статистический скрипт системы:
            </Text>
            <br />
            <Text>
              • IP‑адрес;
            </Text>
            <br />
            <Text>
              • информация из cookies;
            </Text>
            <br />
            <Text>
              • информация о браузере (или иной программе, которая осуществляет доступ к показу рекламы);
            </Text>
            <br />
            <Text>
              • время доступа;
            </Text>
            <br />
            <Text>
              • адрес страницы, на которой расположен рекламный блок;
            </Text>
            <br />
            <Text>
              • реферер (адрес предыдущей страницы).
            </Text>
            <br />
            <Text>
              3.3.1. Отключение cookies может повлечь невозможность доступа к частям сайта Интернет-магазина «SCK», требующим авторизации.
            </Text>
            <br />
            <Text>
              3.3.2. Интернет-магазин «SCK» осуществляет сбор статистики об IP‑адресах своих посетителей. Данная информация используется с целью выявления и решения технических проблем, для контроля законности проводимых финансовых платежей.
            </Text>
            <br />
            <Text>
              3.4. Любая иная персональная информация, не оговоренная выше (история покупок, используемые браузеры и операционные системы и т.д.), подлежит надежному хранению и нераспространению, за исключением случаев,
              предусмотренных в п.п. 5.2. и 5.3. настоящей Политики конфиденциальности.
            </Text>
          </Paragraph>

          {/* 4. ЦЕЛИ СБОРА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЯ */}
          <Paragraph>
            <Title level={4}>4. ЦЕЛИ СБОРА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЯ</Title>
            <Text>
              4.1. Персональные данные Пользователя Администрация сайта интернет-магазина «SCK» может использовать в целях:
            </Text>
            <br />
            <Text>
              4.1.1. Идентификации Пользователя, зарегистрированного на сайте Интернет-магазина «SCK», для оформления заказа и (или) заключения Договора купли-продажи товара дистанционным способом.
            </Text>
            <br />
            <Text>
              4.1.2. Предоставления Пользователю доступа к персонализированным ресурсам сайта Интернет-магазина «SCK».
            </Text>
            <br />
            <Text>
              4.1.3. Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования сайта Интернет-магазина «SCK», оказания услуг, обработка запросов и заявок от Пользователя.
            </Text>
            <br />
            <Text>
              4.1.4. Определения места нахождения Пользователя для обеспечения безопасности, предотвращения мошенничества.
            </Text>
            <br />
            <Text>
              4.1.5. Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.
            </Text>
            <br />
            <Text>
              4.1.6. Создания учетной записи для совершения покупок.
            </Text>
            <br />
            <Text>
              4.1.7. Уведомления Пользователя сайта Интернет-магазина «SCK» о состоянии заказа.
            </Text>
            <br />
            <Text>
              4.1.8. Обработки и получения платежей, оспаривания платежа.
            </Text>
            <br />
            <Text>
              4.1.9. Предоставления Пользователю эффективной клиентской и технической поддержки при возникновении проблем, связанных с использованием сайта Интернет-магазина «SCK».
            </Text>
            <br />
            <Text>
              4.1.10. Предоставления Пользователю специальных предложений, информации о ценах, проводимых и предстоящих акциях, новостной рассылки и иных сведений от имени ТОО «SCK» и/или Интернет-магазина «SCK», или от имени партнеров Интернет-магазина «SCK». При этом частота рассылки рекламных материалов не может превышать одного письма и одного SMS‑сообщения в день.
            </Text>
            <br />
            <Text>
              4.1.11. Осуществления рекламной деятельности.
            </Text>
            <br />
            <Text>
              4.1.12. Предоставления доступа Пользователю на сайты или сервисы партнеров Интернет-магазина «SCK».
            </Text>
            <br />
            <Text>
              4.2. Пользователь вправе отказаться от получения рассылки в любое время, кликнув по ссылке «Отписаться внизу письма» или направив соответствующее письмо по адресу или электронному адресу, указанному в п. 9.4. настоящей Политики о конфиденциальности.
            </Text>
          </Paragraph>

          {/* 5. СПОСОБЫ И СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ */}
          <Paragraph>
            <Title level={4}>5. СПОСОБЫ И СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ</Title>
            <Text>
              5.1. Обработка персональных данных Пользователя осуществляется без ограничения срока, любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств.
            </Text>
            <br />
            <Text>
              5.2. Пользователь соглашается с тем, что Администрация сайта вправе передавать персональные данные третьим лицам, в частности, курьерским службам, организациями почтовой связи, операторам электросвязи, исключительно в целях выполнения заказа Пользователя, оформленного на сайте Интернет-магазина «SCK», включая доставку товара.
            </Text>
            <br />
            <Text>
              5.3. Персональные данные Пользователя могут быть переданы уполномоченным органам государственной власти Республики Казахстан по основаниям и в порядке, установленным законодательством Республики Казахстан.
            </Text>
            <br />
            <Text>
              5.4. При утрате или разглашении персональных данных Администрация сайта информирует Пользователя об утрате или разглашении персональных данных.
            </Text>
            <br />
            <Text>
              5.5. Администрация сайта принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц.
            </Text>
            <br />
            <Text>
              5.6. Администрация сайта совместно с Пользователем принимает все необходимые меры по предотвращению убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.
            </Text>
          </Paragraph>

          {/* 6. ОБЯЗАТЕЛЬСТВА СТОРОН */}
          <Paragraph>
            <Title level={4}>6. ОБЯЗАТЕЛЬСТВА СТОРОН</Title>
            <Text>
              6.1. Пользователь обязан:
            </Text>
            <br />
            <Text>
              6.1.1. Предоставить информацию о персональных данных, необходимую для пользования сайтом Интернет-магазина «SCK».
            </Text>
            <br />
            <Text>
              6.1.2. Обновить, дополнить предоставленную информацию о персональных данных в случае изменения данной информации.
            </Text>
            <br />
            <Text>
              6.2. Администрация сайта обязана:
            </Text>
            <br />
            <Text>
              6.2.1. Использовать полученную информацию исключительно для целей, указанных в п. 4 настоящей Политики конфиденциальности.
            </Text>
            <br />
            <Text>
              6.2.2. Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование, либо разглашение иными возможными способами переданных персональных данных Пользователя, за исключением п.п. 5.2. и 5.3. настоящей Политики Конфиденциальности.
            </Text>
            <br />
            <Text>
              6.2.3. Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку, обычно используемого для защиты такого рода информации в существующем деловом обороте.
            </Text>
            <br />
            <Text>
              6.2.4. Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или запроса Пользователя или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки, в случае выявления недостоверных персональных данных или неправомерных действий.
            </Text>
          </Paragraph>

          {/* 7. ОТВЕТСТВЕННОСТЬ СТОРОН */}
          <Paragraph>
            <Title level={4}>7. ОТВЕТСТВЕННОСТЬ СТОРОН</Title>
            <Text>
              7.1. Администрация сайта, не исполнившая свои обязательства, несёт ответственность за убытки, ограниченные суммой реального ущерба, понесённые Пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Республики Казахстан, за исключением случаев, предусмотренных п.п. 5.2., 5.3. и 7.2. настоящей Политики Конфиденциальности.
            </Text>
            <br />
            <Text>
              7.2. В случае утраты или разглашения конфиденциальной информации Администрация сайта не несёт ответственность, если данная конфиденциальная информация:
            </Text>
            <br />
            <Text>
              7.2.1. Стала публичным достоянием до её утраты или разглашения.
            </Text>
            <br />
            <Text>
              7.2.2. Была получена от третьей стороны до момента её получения Администрацией сайта от Пользователя.
            </Text>
            <br />
            <Text>
              7.2.3. Была разглашена с согласия Пользователя.
            </Text>
          </Paragraph>

          {/* 8. РАЗРЕШЕНИЕ СПОРОВ */}
          <Paragraph>
            <Title level={4}>8. РАЗРЕШЕНИЕ СПОРОВ</Title>
            <Text>
              8.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем сайта Интернет-магазина «SCK» и Администрацией сайта, ТОО «SCK», обязательным является предъявление претензии (письменного предложения о добровольном урегулировании спора).
            </Text>
            <br />
            <Text>
              8.2. Получатель претензии в течение 30 календарных дней со дня получения претензии, письменно уведомляет заявителя претензии о результатах рассмотрения претензии.
            </Text>
            <br />
            <Text>
              8.3. При недостижении соглашения спор будет передан на рассмотрение в судебный орган в соответствии с действующим законодательством Республики Казахстан.
            </Text>
            <br />
            <Text>
              8.4. К настоящей Политики конфиденциальности и отношениям между Пользователем и Администрацией сайта, ТОО «SCK» (SCK), применяется действующее законодательство Республики Казахстан.
            </Text>
          </Paragraph>

          {/* 9. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ */}
          <Paragraph>
            <Title level={4}>9. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</Title>
            <Text>
              9.1. Администрация сайта вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.
            </Text>
            <br />
            <Text>
              9.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения на сайте Интернет-магазина «SCK», если иное не предусмотрено новой редакцией Политики конфиденциальности.
            </Text>
            <br />
            <Text>
              9.3. Все предложения или вопросы по настоящей Политике конфиденциальности следует сообщать в разделе «Отзывы и предложения» сайта Интернет-магазина «SCK».
            </Text>
          </Paragraph>
        </Typography>
      </Card>
    </Col>
  );
};

export default PrivacyPolicy;
